000000*AA1ABBB+----2----+----3----+----4----+----5----+----6----+----7--SEQUENCE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CMDLINE.
       AUTHOR. Andras Pahi.
       DATE-WRITTEN. 11/23/2025.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. GnuCOBOL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ARGC PIC 9(3) VALUE ZEROS.
       01 WS-ARG  PIC X(80) VALUE SPACES.
       01 WS-CNT  PIC 9(3) VALUE ZEROS.
       01 WS-COMMAND-LINE PIC X(80) VALUE SPACES.
       PROCEDURE DIVISION.
           ACCEPT WS-COMMAND-LINE FROM COMMAND-LINE
           DISPLAY 'COMMAND-LINE=/' WS-COMMAND-LINE '/'
           ACCEPT WS-ARGC FROM ARGUMENT-NUMBER
           DISPLAY 'ARGC=' WS-ARGC
           PERFORM VARYING WS-CNT FROM 1 BY 1
               UNTIL WS-CNT > WS-ARGC
               DISPLAY WS-CNT UPON ARGUMENT-NUMBER
               ACCEPT WS-ARG FROM ARGUMENT-VALUE
               DISPLAY WS-CNT 'TH ARG=' WS-ARG
           END-PERFORM
           STOP RUN
           .
