000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. DISPLAY0.
000030******************************************************************
000040* JUST TESTING SOMETHING. OK TO REUSE THIS FOR SOMETHING ELSE.   *
000050******************************************************************
000070 ENVIRONMENT DIVISION.
000080 CONFIGURATION SECTION.
000090 REPOSITORY.
000100 FUNCTION ALL INTRINSIC.
000110 DATA DIVISION.
000120 WORKING-STORAGE SECTION.
000130
000140 01  MISC-WORKING-STORAGE.
           05  BIN-CHAR                USAGE BINARY-CHAR    VALUE 1.
           05  BIN-SHRT                USAGE BINARY-SHORT   VALUE 1.
           05  BIN-LONG                USAGE BINARY-LONG    VALUE 1.
           05  BIN-DOBL                USAGE BINARY-DOUBLE  VALUE 1.

000150     05  CHAR-1                  PIC 9(01) COMP-5 VALUE 1. 
           05  CHAR-2                  PIC 9(02) COMP-5 VALUE 1.
           05  CHAR-3                  PIC 9(03) COMP-5 VALUE 1.
           05  CHAR-4                  PIC 9(04) COMP-5 VALUE 1.
           05  CHAR-5                  PIC 9(05) COMP-5 VALUE 1.
           05  CHAR-6                  PIC 9(06) COMP-5 VALUE 1.
           05  CHAR-7                  PIC 9(07) COMP-5 VALUE 1.
           05  CHAR-8                  PIC 9(08) COMP-5 VALUE 1.
           05  CHAR-9                  PIC 9(09) COMP-5 VALUE 1.
           05  CHAR-10                 PIC 9(10) COMP-5 VALUE 1.
           05  CHAR-11                 PIC 9(11) COMP-5 VALUE 1.
           05  CHAR-12                 PIC 9(12) COMP-5 VALUE 1.
           05  CHAR-13                 PIC 9(13) COMP-5 VALUE 1.
           05  CHAR-14                 PIC 9(14) COMP-5 VALUE 1.
           05  CHAR-15                 PIC 9(15) COMP-5 VALUE 1.
           05  CHAR-16                 PIC 9(16) COMP-5 VALUE 1.
           05  CHAR-17                 PIC 9(17) COMP-5 VALUE 1.
           05  CHAR-18                 PIC 9(18) COMP-5 VALUE 1.

000170
000180 PROCEDURE DIVISION.
000230
000240 000-BEGIN-PROGRAM.
000250
000260     DISPLAY SPACE.
000270
           DISPLAY "BINARY-CHAR      In hex is " HEX-OF(BIN-CHAR)
000280     DISPLAY "CPMP-5 PIC 9(01) In hex is " HEX-OF(CHAR-1)
           DISPLAY "CPMP-5 PIC 9(02) In hex is " HEX-OF(CHAR-2)
           DISPLAY "BINARY-SHORT     In hex is " HEX-OF(BIN-SHRT)
           DISPLAY "CPMP-5 PIC 9(03) In hex is " HEX-OF(CHAR-3)
           DISPLAY "CPMP-5 PIC 9(04) In hex is " HEX-OF(CHAR-4)
           DISPLAY "BINARY-LONG      In hex is " HEX-OF(BIN-LONG)
           DISPLAY "CPMP-5 PIC 9(05) In hex is " HEX-OF(CHAR-5)
           DISPLAY "CPMP-5 PIC 9(06) In hex is " HEX-OF(CHAR-6)
           DISPLAY "CPMP-5 PIC 9(07) In hex is " HEX-OF(CHAR-7)
           DISPLAY "CPMP-5 PIC 9(08) In hex is " HEX-OF(CHAR-8)
           DISPLAY "CPMP-5 PIC 9(09) In hex is " HEX-OF(CHAR-9)
           DISPLAY "BINARY-DOUBLE    In hex is " HEX-OF(BIN-DOBL)
           DISPLAY "CPMP-5 PIC 9(10) In hex is " HEX-OF(CHAR-10)
           DISPLAY "CPMP-5 PIC 9(11) In hex is " HEX-OF(CHAR-11)
           DISPLAY "CPMP-5 PIC 9(12) In hex is " HEX-OF(CHAR-12)
           DISPLAY "CPMP-5 PIC 9(13) In hex is " HEX-OF(CHAR-13)
           DISPLAY "CPMP-5 PIC 9(14) In hex is " HEX-OF(CHAR-14)
           DISPLAY "CPMP-5 PIC 9(15) In hex is " HEX-OF(CHAR-15)
           DISPLAY "CPMP-5 PIC 9(16) In hex is " HEX-OF(CHAR-16)
           DISPLAY "CPMP-5 PIC 9(17) In hex is " HEX-OF(CHAR-17)
           DISPLAY "CPMP-5 PIC 9(18) In hex is " HEX-OF(CHAR-18)

000310
000320     GOBACK.
