000000*AA1ABBB+----2----+----3----+----4----+----5----+----6----+----7--SEQUENCE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SCR002.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CURSOR IS CURSOR-POSITION.
           CONSOLE IS CRT.
           CRT STATUS IS KEYBOARD-STATUS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CURSOR-POSITION.
           03 CURSOR-ROW    PIC 9(3) VALUE 1.
           03 CURSOR-COLUMN PIC 9(3) VALUE 1.
       01 KEYBOARD-STATUS   PIC 9(4).
       01 DOLLAR-AMOUNT     PIC 9(5)V99 VALUE 12.99.
       01 ITEM-DESCRIPTION  PIC X(10) VALUE 'Gold Coins'.
       01 NEW-ITEM-DESCRIPTION  PIC X(10) VALUE SPACES.
       SCREEN SECTION.
       01 MAIN-SCREEN
          BLANK SCREEN, AUTO, REQUIRED,
          FOREGROUND-COLOR IS 7,
          BACKGROUND-COLOR IS 1.
          03 LINE 01 COLUMN 35 VALUE 'Item Entry'.
          03 LINE 03 COLUMN  5 VALUE 'Item Value ' HIGHLIGHT BELL.
          03 LINE 03 COLUMN 16 PIC $$,$$$.99 FROM DOLLAR-AMOUNT.
          03 LINE 05 COLUMN  5 VALUE 'Item Description' HIGHLIGHT.
          03 LINE 05 COLUMN 22 PIC X(10) FROM ITEM-DESCRIPTION
                                         TO   NEW-ITEM-DESCRIPTION.
          03 LINE 06 COLUMN  4 VALUE 'Short Description' HIGHLIGHT.
          03 LINE 06 COLUMN 22 PIC X(5) FROM ITEM-DESCRIPTION
                                        JUSTIFIED RIGHT.
       01 STATUS-SCREEN
          BLANK SCREEN, AUTO, REQUIRED,
          FOREGROUND-COLOR IS 7,
          BACKGROUND-COLOR IS 1.
          03 LINE 01 COLUMN 01 VALUE 'NEW-ITEM-DESCRIPTION... '.
          03 LINE 01 COLUMN 25 PIC X(10) FROM NEW-ITEM-DESCRIPTION.
          03 LINE 02 COLUMN 01 VALUE 'CURSOR-POSITION........ '.
          03 LINE 02 COLUMN 25 PIC 99/99 FROM CURSOR-POSITION.
          03 LINE 03 COLUMN 01 VALUE 'KEYBOARD-STATUS........ '.
          03 LINE 03 COLUMN 25 PIC 9(4) FROM KEYBOARD-STATUS.

       PROCEDURE DIVISION.
       CHAPT04A-START.
           SET ENVIRONMENT 'COB_SCREEN_EXCEPTIONS' TO 'Y'.
           SET ENVIRONMENT 'COB_SCREEN_ESC'        TO 'Y'.
      *    DISPLAY MAIN-SCREEN AT LINE 2 COLUMN 10
           DISPLAY MAIN-SCREEN
           ACCEPT MAIN-SCREEN
           DISPLAY SPACE AT LINE 01 COLUMN 01 ERASE EOS
           DISPLAY STATUS-SCREEN
           .
