       01 IO-PARAMS.
          03 IO-IOP      PIC 9(2).
             88 IOP-GET-ARGC      VALUE 1.
             88 IOP-GET-ARG       VALUE 2.
             88 IOP-ACCEPT        VALUE 3.
          03 IO-P-NUMBER  PIC 9(3).
          03 IO-P-STRING  PIC X(80).
          03 IO-P-CHAR    PIC X.
