       01 E-:BUS:-1 PIC 9(01) USAGE IS :TAG:.
       01 E-:BUS:-2 PIC 9(02) USAGE IS :TAG:.
       01 E-:BUS:-3 PIC 9(03) USAGE IS :TAG:.
       01 E-:BUS:-4 PIC 9(04) USAGE IS :TAG:.
       01 E-:BUS:-5 PIC 9(05) USAGE IS :TAG:.

